Revit 2027 API
Document.Import(String, GBXMLImportOptions) Method
Imports a Green-Building XML file into the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Import(
	string file,
	GBXMLImportOptions options
)
Public Function Import (
	file As String,
	options As GBXMLImportOptions
) As Boolean
public:
bool Import(
	String^ file,
	GBXMLImportOptions^ options
)
member Import :
        file : string *
        options : GBXMLImportOptions -> bool
Parameters
file String
Full path of the file to import. File must exist.
options GBXMLImportOptions
Various options applicable to GBXml import. If null, all options will be set to their respective default values.
Return Value
Boolean
True if successful, otherwise False.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when file argument is null or empty.
FileNotFoundException | Thrown when the file specified does not exist.
ArgumentException | Thrown when no file is specified or if the file is not a valid gbXML file or does not contain any result elements.
Remarks
This method is available only in MEP. Though the 'options' argument is not currently used, an object still must be provided (may be null). The method will return False if not succeed. e.g when the input xml file does not contain any result elements.
See Also
Reference
Document Class
Import Overload
Autodesk.Revit.DB Namespace